modm-ext/archive-stmicro-svd/header_stm32h755bit3@m4.svd
      <register>
        <name>MICR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MCMP1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP2</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP3</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP4</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MREP</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNC</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUPD</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MDIER</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MCMP1IE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP2IE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP3IE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP4IE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MREPIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNCIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUPDIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP1DE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP2DE</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP3DE</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCMP4DE</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MREPDE</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNCDE</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUPDDE</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MCNTR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MCNTR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MPER</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MPER</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MREP</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MREP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MCMP1R</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MCMP4R</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MCMP2R</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>MCMP3R</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>MCMP4R</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.TIMxCR</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.TIMxISR</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.TIMxICR</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.TIMxDIER</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CNTxR</name>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.PERxR</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.REPxR</name>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CMP1xR</name>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CMP1CxR</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CMP2xR</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CMP3xR</name>
        <addressOffset>0xa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CMP4xR</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CPT1xR</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CPT2xR</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.DTxR</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.SETx1R</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.RSTx1R</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.SETx2R</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.RSTx2R</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.EEFxR1</name>
        <addressOffset>0xcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.EEFxR2</name>
        <addressOffset>0xd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.RSTxR</name>
        <addressOffset>0xd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CHPxR</name>
        <addressOffset>0xd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CPT1xCR</name>
        <addressOffset>0xdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.CPT2xCR</name>
        <addressOffset>0xe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.OUTxR</name>
        <addressOffset>0xe4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.0.FLTxR</name>
        <addressOffset>0xe8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.TIMxCR</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.TIMxISR</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.TIMxICR</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.TIMxDIER</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CNTxR</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.PERxR</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.REPxR</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CMP1xR</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CMP1CxR</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CMP2xR</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CMP3xR</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CMP4xR</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CPT1xR</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CPT2xR</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.DTxR</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.SETx1R</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.RSTx1R</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.SETx2R</name>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.RSTx2R</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.EEFxR1</name>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.EEFxR2</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.RSTxR</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CHPxR</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CPT1xCR</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.CPT2xCR</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.OUTxR</name>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.1.FLTxR</name>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.TIMxCR</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.TIMxISR</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.TIMxICR</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.TIMxDIER</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CNTxR</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.PERxR</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.REPxR</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CMP1xR</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CMP1CxR</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CMP2xR</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CMP3xR</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CMP4xR</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CPT1xR</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CPT2xR</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.DTxR</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.SETx1R</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.RSTx1R</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.SETx2R</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.RSTx2R</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.EEFxR1</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.EEFxR2</name>
        <addressOffset>0x1d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.RSTxR</name>
        <addressOffset>0x1d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CHPxR</name>
        <addressOffset>0x1d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CPT1xCR</name>
        <addressOffset>0x1dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.CPT2xCR</name>
        <addressOffset>0x1e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.OUTxR</name>
        <addressOffset>0x1e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.2.FLTxR</name>
        <addressOffset>0x1e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.TIMxCR</name>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.TIMxISR</name>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.TIMxICR</name>
        <addressOffset>0x208</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.TIMxDIER</name>
        <addressOffset>0x20c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CNTxR</name>
        <addressOffset>0x210</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.PERxR</name>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.REPxR</name>
        <addressOffset>0x218</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CMP1xR</name>
        <addressOffset>0x21c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CMP1CxR</name>
        <addressOffset>0x220</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CMP2xR</name>
        <addressOffset>0x224</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CMP3xR</name>
        <addressOffset>0x228</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CMP4xR</name>
        <addressOffset>0x22c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CPT1xR</name>
        <addressOffset>0x230</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CPT2xR</name>
        <addressOffset>0x234</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.DTxR</name>
        <addressOffset>0x238</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.SETx1R</name>
        <addressOffset>0x23c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.RSTx1R</name>
        <addressOffset>0x240</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.SETx2R</name>
        <addressOffset>0x244</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.RSTx2R</name>
        <addressOffset>0x248</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.EEFxR1</name>
        <addressOffset>0x24c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.EEFxR2</name>
        <addressOffset>0x250</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.RSTxR</name>
        <addressOffset>0x254</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CHPxR</name>
        <addressOffset>0x258</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CPT1xCR</name>
        <addressOffset>0x25c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.CPT2xCR</name>
        <addressOffset>0x260</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.OUTxR</name>
        <addressOffset>0x264</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.3.FLTxR</name>
        <addressOffset>0x268</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.TIMxCR</name>
        <addressOffset>0x280</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.TIMxISR</name>
        <addressOffset>0x284</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.TIMxICR</name>
        <addressOffset>0x288</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.TIMxDIER</name>
        <addressOffset>0x28c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CNTxR</name>
        <addressOffset>0x290</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.PERxR</name>
        <addressOffset>0x294</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.REPxR</name>
        <addressOffset>0x298</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CMP1xR</name>
        <addressOffset>0x29c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CMP1CxR</name>
        <addressOffset>0x2a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CMP2xR</name>
        <addressOffset>0x2a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CMP3xR</name>
        <addressOffset>0x2a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CMP4xR</name>
        <addressOffset>0x2ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CPT1xR</name>
        <addressOffset>0x2b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.CPT2xR</name>
        <addressOffset>0x2b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.DTxR</name>
        <addressOffset>0x2b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.SETx1R</name>
        <addressOffset>0x2bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.RSTx1R</name>
        <addressOffset>0x2c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.SETx2R</name>
        <addressOffset>0x2c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.RSTx2R</name>
        <addressOffset>0x2c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.EEFxR1</name>
        <addressOffset>0x2cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>sTimerxRegs.4.EEFxR2</name>
        <addressOffset>0x2d0</addressOffset>
        <size>0x20</size>
      </register>
