modm-ext/archive-stmicro-svd/header_stm32h755bit3@m4.svd
      <register>
        <name>MACTSCR</name>
        <addressOffset>0xb00</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSENA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSCFUPDT</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSINIT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSUPDT</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSADDREG</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSENALL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSCTRLSSR</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSVER2ENA</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSIPENA</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSIPV6ENA</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSIPV4ENA</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSEVNTENA</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSMSTRENA</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SNAPTYPSEL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TSENMACADDR</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CSC</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXTSSTSM</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSSIR</name>
        <addressOffset>0xb04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>MACSTSR</name>
        <addressOffset>0xb08</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSTNR</name>
        <addressOffset>0xb0c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSSS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSTSUR</name>
        <addressOffset>0xb10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSTNUR</name>
        <addressOffset>0xb14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSSS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
          <field>
            <name>ADDSUB</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSAR</name>
        <addressOffset>0xb18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSSR</name>
        <addressOffset>0xb20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSSOVF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSTARGT0</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AUXTSTRIG</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSTRGTERR0</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXTSSIS</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSSTN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ATSSTM</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSNS</name>
            <bitOffset>25</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTTSSNR</name>
        <addressOffset>0xb30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXTSSLO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
          <field>
            <name>TXTSSMIS</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTTSSSR</name>
        <addressOffset>0xb34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXTSSHI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACACR</name>
        <addressOffset>0xb40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ATSFC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSEN0</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSEN1</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSEN2</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATSEN3</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACATSNR</name>
        <addressOffset>0xb48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AUXTSLO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACATSSR</name>
        <addressOffset>0xb4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AUXTSHI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSIACR</name>
        <addressOffset>0xb50</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OSTIAC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSEACR</name>
        <addressOffset>0xb54</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OSTEAC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSICNR</name>
        <addressOffset>0xb58</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSIC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACTSECNR</name>
        <addressOffset>0xb5c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPPSCR</name>
        <addressOffset>0xb70</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PPSCTRL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>PPSEN0</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGTMODSEL0</name>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPPSTTSR</name>
        <addressOffset>0xb80</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSTRH0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPPSTTNR</name>
        <addressOffset>0xb84</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TTSL0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
          <field>
            <name>TRGTBUSY0</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPPSIR</name>
        <addressOffset>0xb88</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PPSINT0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPPSWR</name>
        <addressOffset>0xb8c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PPSWIDTH0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACPOCR</name>
        <addressOffset>0xbc0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PTOEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ASYNCEN</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>APDREQEN</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ASYNCTRIG</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>APDREQTRIG</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DRRDIS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSPI0R</name>
        <addressOffset>0xbc4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SPI0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSPI1R</name>
        <addressOffset>0xbc8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SPI1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACSPI2R</name>
        <addressOffset>0xbcc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SPI2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MACLMIR</name>
        <addressOffset>0xbd0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LSI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DRSYNCR</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>LMPDRI</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLOMR</name>
        <addressOffset>0xc00</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DTXSTS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNTPRST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNTCLR</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLISR</name>
        <addressOffset>0xc20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>QIS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MACIS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLTQOMR</name>
        <addressOffset>0xd00</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FTQ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TTC</name>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLTQUR</name>
        <addressOffset>0xd04</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UFPKTCNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>UFCNTOVF</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLTQDR</name>
        <addressOffset>0xd08</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXQPAUSED</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRCSTS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TWCSTS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXQSTS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXSTSFSTS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PTXQ</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>STXSTSF</name>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLQICSR</name>
        <addressOffset>0xd2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TXUNFIS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXUIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXOVFIS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXOIE</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLRQOMR</name>
        <addressOffset>0xd30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RTC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>FUP</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEP</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DISTCPEF</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EHFC</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RFA</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>RFD</name>
            <bitOffset>14</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>RQS</name>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLRQMPOCR</name>
        <addressOffset>0xd34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OVFPKTCNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>OVFCNTOVF</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MISPKTCNT</name>
            <bitOffset>16</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>MISCNTOVF</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MTLRQDR</name>
        <addressOffset>0xd38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RWCSTS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RRCSTS_READINGDATA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RRCSTS_READINGSTATUS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXQSTS_FULL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RXQSTS_ABOVETHRESHOLD</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRXQ</name>
            <bitOffset>16</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMAMR</name>
        <addressOffset>0x1000</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SWR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXPR</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PR</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>INTM</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMASBMR</name>
        <addressOffset>0x1004</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AAL</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MB</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RB</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMAISR</name>
        <addressOffset>0x1008</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMACIS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTLIS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MACIS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
